lkolbly/cmsis-svd/data/TexasInstruments/LM4F110H5QR.svd
        <register>
          <name>DBG_INT</name>
          <description>Debug Reset Interrupt Control</description>
          <addressOffset>0x00000DFC</addressOffset>
          <fields>
            <field>
              <name>NVIC_DBG_INT_RSTVCATCH</name>
              <description>Reset vector catch</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>NVIC_DBG_INT_RSTPENDING</name>
              <description>Core reset is pending</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>NVIC_DBG_INT_RSTPENDCLR</name>
              <description>Clear pending core reset</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>NVIC_DBG_INT_RESET</name>
              <description>Core reset status</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>NVIC_DBG_INT_MMERR</name>
              <description>Debug trap on mem manage fault</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>NVIC_DBG_INT_NOCPERR</name>
              <description>Debug trap on coprocessor error</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>NVIC_DBG_INT_CHKERR</name>
              <description>Debug trap on usage fault check</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>NVIC_DBG_INT_STATERR</name>
              <description>Debug trap on usage fault state</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>NVIC_DBG_INT_BUSERR</name>
              <description>Debug trap on bus error</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>NVIC_DBG_INT_INTERR</name>
              <description>Debug trap on interrupt errors</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>NVIC_DBG_INT_HARDERR</name>
              <description>Debug trap on hard fault</description>
              <bitRange>[10:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_TRIG</name>
          <description>Software Trigger Interrupt</description>
          <addressOffset>0x00000F00</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>NVIC_SW_TRIG_INTID</name>
              <description>Interrupt ID</description>
              <bitRange>[7:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FPCC</name>
          <description>Floating-Point Context Control</description>
          <addressOffset>0x00000F34</addressOffset>
          <fields>
            <field>
              <name>NVIC_FPCC_LSPACT</name>
              <description>Lazy State Preservation Active</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>NVIC_FPCC_USER</name>
              <description>User Privilege Level</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>NVIC_FPCC_THREAD</name>
              <description>Thread Mode</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>NVIC_FPCC_HFRDY</name>
              <description>Hard Fault Ready</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>NVIC_FPCC_MMRDY</name>
              <description>Memory Management Fault Ready</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>NVIC_FPCC_BFRDY</name>
              <description>Bus Fault Ready</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>NVIC_FPCC_MONRDY</name>
              <description>Monitor Ready</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>NVIC_FPCC_LSPEN</name>
              <description>Lazy State Preservation Enable</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>NVIC_FPCC_ASPEN</name>
              <description>Automatic State Preservation Enable</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FPCA</name>
          <description>Floating-Point Context Address</description>
          <addressOffset>0x00000F38</addressOffset>
          <fields>
            <field>
              <name>NVIC_FPCA_ADDRESS</name>
              <description>Address</description>
              <bitRange>[31:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FPDSC</name>
          <description>Floating-Point Default Status Control</description>
          <addressOffset>0x00000F3C</addressOffset>
          <fields>
            <field>
              <name>NVIC_FPDSC_RMODE</name>
              <description>RMODE Bit Default</description>
              <bitRange>[23:22]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NVIC_FPDSC_RMODE_RN</name>
                  <description>Round to Nearest (RN) mode</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_FPDSC_RMODE_RP</name>
                  <description>Round towards Plus Infinity (RP) mode</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_FPDSC_RMODE_RM</name>
                  <description>Round towards Minus Infinity (RM) mode</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_FPDSC_RMODE_RZ</name>
                  <description>Round towards Zero (RZ) mode</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NVIC_FPDSC_FZ</name>
              <description>FZ Bit Default</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>NVIC_FPDSC_DN</name>
              <description>DN Bit Default</description>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>NVIC_FPDSC_AHP</name>
              <description>AHP Bit Default</description>
              <bitRange>[26:26]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
  </peripherals>
  <vendorExtensions>
    <memory>
      <name>FLASH</name>
      <description>FLASH Memory Map for lm4f110h5qr</description>
      <baseAddress>0x00000000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00040000</size>
        <usage>FLASH Memory</usage>
      </addressBlock>
    </memory>
    <memory>
      <name>ROM</name>
      <description>ROM Memory Map for lm4f110h5qr</description>
      <baseAddress>0x01000000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00008c00</size>
        <usage>ROM Boot Loader/StellarisWare</usage>
      </addressBlock>
    </memory>
    <memory>
      <name>SRAM</name>
      <description>SRAM Memory Map for lm4f110h5qr</description>
      <baseAddress>0x20000000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00008000</size>
        <usage>SRAM</usage>
      </addressBlock>
    </memory>
  </vendorExtensions>
</device>
